---
kind: type
id: T:Autodesk.Revit.DB.Structure.AnalyticalRigidLinksOption
source: html/e41f4cbb-e7a9-9481-114d-7c1eb851834b.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalRigidLinksOption

Specifies how Rigid Links will be made for the Analytical Model.

## Syntax (C#)
```csharp
public enum AnalyticalRigidLinksOption
```

## Remarks
Rigid Links are curves connecting neighboring Structural Beams and Structural Columns.